In [2]:
topic_file = "/data/movie_data/movies.csv"
users_file = "/data/movie_data/users.csv"
ratings_file = "/data/movie_data/rating.csv"

In [3]:
import pandas as pd
topics = pd.read_csv(topic_file)

In [4]:
topics.head()

   ID                                NAME                      CATEGORY
0   1                    Toy Story (1995)   Animation|Children's|Comedy
1   2                      Jumanji (1995)  Adventure|Children's|Fantasy
2   3             Grumpier Old Men (1995)                Comedy|Romance
3   4            Waiting to Exhale (1995)                  Comedy|Drama
4   5  Father of the Bride Part II (1995)                        Comedy

In [5]:
ratings = pd.read_csv(ratings_file)
ratings.head()

   UserID  MovieID  Rating  Timestamp
0       1     1193       5  978300760
1       1      661       3  978302109
2       1      914       3  978301968
3       1     3408       4  978300275
4       1     2355       5  978824291

In [6]:
users = pd.read_csv(users_file)
users.head()

   UserID Gender  Age  Occupation Zip-code
0       1      F    1          10    48067
1       2      M   56          16    70072
2       3      M   25          15    55117
3       4      M   45           7    02460
4       5      M   25          20    55455

In [7]:
user_rating = pd.merge(users,ratings,on='UserID')
user_rating_mv = pd.merge(user_rating, topics, left_on="MovieID", right_on="ID")

In [8]:
user_rating_mv

,UserID,Gender,Age,Occupation,Zip-code,MovieID,Rating,Timestamp,ID,NAME,CATEGORY
0,1,F,1,10,48067,1193,5,978300760,1193,One Flew Over the Cuckoo's Nest (1975),Drama
1,2,M,56,16,70072,1193,5,978298413,1193,One Flew Over the Cuckoo's Nest (1975),Drama
2,12,M,25,12,32793,1193,4,978220179,1193,One Flew Over the Cuckoo's Nest (1975),Drama
3,15,M,25,7,22903,1193,4,978199279,1193,One Flew Over the Cuckoo's Nest (1975),Drama
4,17,M,50,1,95350,1193,5,978158471,1193,One Flew Over the Cuckoo's Nest (1975),Drama
...,...,...,...,...,...,...,...,...,...,...,...
1000204,5949,M,18,17,47901,2198,5,958846401,2198,Modulations (1998),Documentary
1000205,5675,M,35,14,30030,2703,3,976029116,2703,Broken Vessels (1998),Drama
1000206,5780,M,18,17,92886,2845,1,958153068,2845,White Boys (1999),Drama
1000207,5851,F,18,20,55410,3607,5,957756608,3607,One Little Indian (1973),Comedy|Drama|Western
1000208,5938,M,25,1,35401,2909,4,957273353,2909,"Five Wives, Three Secretaries and Me (1998)",Documentary

In [46]:
#df = pd.DataFrame().reset_index()

user_rating_mv[['Gender','Age', 'NAME']].groupby(['Gender','Age','NAME']).count()

Empty DataFrame
Columns: []
Index: [(F, 1, 'Night Mother (1986)), (F, 1, 'Til There Was You (1997)), (F, 1, 10 Things I Hate About You (1999)), (F, 1, 101 Dalmatians (1961)), (F, 1, 101 Dalmatians (1996)), (F, 1, 12 Angry Men (1957)), (F, 1, 13th Warrior, The (1999)), (F, 1, 2 Days in the Valley (1996)), (F, 1, 20,000 Leagues Under the Sea (1954)), (F, 1, 200 Cigarettes (1999)), (F, 1, 2001: A Space Odyssey (1968)), (F, 1, 2010 (1984)), (F, 1, 28 Days (2000)), (F, 1, 3 Ninjas: High Noon On Mega Mountain (1998)), (F, 1, 39 Steps, The (1935)), (F, 1, 400 Blows, The (Les Quatre cents coups) (1959)), (F, 1, 54 (1998)), (F, 1, 7th Voyage of Sinbad, The (1958)), (F, 1, 8 1/2 (1963)), (F, 1, 8 Heads in a Duffel Bag (1997)), (F, 1, 8MM (1999)), (F, 1, Abbott and Costello Meet Frankenstein (1948)), (F, 1, About Last Night... (1986)), (F, 1, Absent Minded Professor, The (1961)), (F, 1, Abyss, The (1989)), (F, 1, Ace Ventura: Pet Detective (1994)), (F, 1, Ace Ventura: When Nature Calls (1995)), (F, 1, Addams Family Values (1993)), (F, 1, Addams Family, The (1991)), (F, 1, Addicted to Love (1997)), (F, 1, Addiction, The (1995)), (F, 1, Adventures of Buckaroo Bonzai Across the 8th Dimension, The (1984)), (F, 1, Adventures of Elmo in Grouchland, The (1999)), (F, 1, Adventures of Milo and Otis, The (1986)), (F, 1, Adventures of Pinocchio, The (1996)), (F, 1, Adventures of Robin Hood, The (1938)), (F, 1, Adventures of Rocky and Bullwinkle, The (2000)), (F, 1, Affair to Remember, An (1957)), (F, 1, Affliction (1997)), (F, 1, African Queen, The (1951)), (F, 1, Afterglow (1997)), (F, 1, Age of Innocence, The (1993)), (F, 1, Agnes of God (1985)), (F, 1, Aim�e & Jaguar (1999)), (F, 1, Aiqing wansui (1994)), (F, 1, Air Bud (1997)), (F, 1, Air Bud: Golden Receiver (1998)), (F, 1, Air Force One (1997)), (F, 1, Air Up There, The (1994)), (F, 1, Airheads (1994)), (F, 1, Airplane II: The Sequel (1982)), (F, 1, Airplane! (1980)), (F, 1, Airport (1970)), (F, 1, Akira (1988)), (F, 1, Aladdin (1992)), (F, 1, Aladdin and the King of Thieves (1996)), (F, 1, Alaska (1996)), (F, 1, Alice in Wonderland (1951)), (F, 1, Alien (1979)), (F, 1, Alien Nation (1988)), (F, 1, Alien: Resurrection (1997)), (F, 1, Aliens (1986)), (F, 1, Alien� (1992)), (F, 1, Alive (1993)), (F, 1, All About Eve (1950)), (F, 1, All About My Mother (Todo Sobre Mi Madre) (1999)), (F, 1, All Dogs Go to Heaven (1989)), (F, 1, All Dogs Go to Heaven 2 (1996)), (F, 1, All Quiet on the Western Front (1930)), (F, 1, All That Jazz (1979)), (F, 1, All the King's Men (1949)), (F, 1, Alley Cats, The (1968)), (F, 1, Almost Famous (2000)), (F, 1, Almost Heroes (1998)), (F, 1, Amadeus (1984)), (F, 1, Amazing Panda Adventure, The (1995)), (F, 1, American Beauty (1999)), (F, 1, American Flyers (1985)), (F, 1, American Gigolo (1980)), (F, 1, American Graffiti (1973)), (F, 1, American History X (1998)), (F, 1, American Movie (1999)), (F, 1, American Pie (1999)), (F, 1, American Pimp (1999)), (F, 1, American President, The (1995)), (F, 1, American Psycho (2000)), (F, 1, American Tail, An (1986)), (F, 1, American Tail: Fievel Goes West, An (1991)), (F, 1, American Werewolf in London, An (1981)), (F, 1, American Werewolf in Paris, An (1997)), (F, 1, American in Paris, An (1951)), (F, 1, Amistad (1997)), (F, 1, Amityville Horror, The (1979)), (F, 1, Amityville: A New Generation (1993)), (F, 1, Anaconda (1997)), (F, 1, Analyze This (1999)), (F, 1, Anastasia (1997)), (F, 1, Anatomy (Anatomie) (2000)), (F, 1, Anatomy of a Murder (1959)), (F, 1, Anchors Aweigh (1945)), ...]

[40046 rows x 0 columns]

In [43]:
#df.groupby(level=[0,1]).nlargest(5).reset_index(level=0, drop=True)

Age  Gender  Age  NAME
1    F       1    Toy Story (1995)                                          39
                  Aladdin (1992)                                            36
                  Toy Story 2 (1999)                                        36
                  Babe (1995)                                               34
                  E.T. the Extra-Terrestrial (1982)                         33
                                                                          ...
56   M       56   American Beauty (1999)                                   130
                  Schindler's List (1993)                                   95
                  Star Wars: Episode V - The Empire Strikes Back (1980)     94
                  Jurassic Park (1993)                                      93
                  Shakespeare in Love (1998)                                93
Name: NAME, Length: 70, dtype: int64

In [42]:
df2

                                                                          NAME
Gender Age Gender Age NAME
F      1   F      1   Toy Story (1995)                                      39
                      Aladdin (1992)                                        36
                      Toy Story 2 (1999)                                    36
                      Babe (1995)                                           34
                      E.T. the Extra-Terrestrial (1982)                     33
...                                                                        ...
M      56  M      56  American Beauty (1999)                               130
                      Schindler's List (1993)                               95
                      Star Wars: Episode V - The Empire Strikes Back ...    94
                      Jurassic Park (1993)                                  93
                      Shakespeare in Love (1998)                            93

[70 rows x 1 columns]